FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2016-2019 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

/**********************************************************************************************************************
 * File Name    : r_sci_rx.c
 * Description  : Functions for using SCI on RX devices.
 ***********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *           01.10.2016 1.80    Initial Release. (The remake of the r01an1815ju0170 to the base.)
 *           19.12.2016 1.90    FIT_NO_PTR check added to NULL check.
 *                              Fixed a bug that may receive data more than the specified number of bytes
 *                               on Clock Synchronous Mode.
 *                              Fixed that R_SCI_Control function returns SCI_ERR_INVALID_ARG
 *                               when using SCI_CMD_EN_CTS_IN on Simple SPI mode.
 *                              Fix to clear error flag even if callback function is not set.
 *                              Deleted unnecessary bit mask of SSR register from sci_error function.
 *           07.03.2017 2.00    Fixed a bug that error condition not clear when FIFO enabled.
 *                              Fixed a bug that where commands used only when FIFO mode is enable did not NULL check.
 *                              Fixed a bug that sending data is overwrote by new R_SCI_Send() when FIFO(async) enabled.
 *                              Fixed a bug that sending data is break up by new R_SCI_Send() when FIFO(sync) enabled.
 *                              Fixed a bug that the new FIFO threshold was retained only on first receive.
 *                              Fixed a bug that callback function work many times at receive interrupt
 *                               when FIFO(async) enabled.
 *                              Fixed a bug that the interrupt priority level can be changed only in async mode.
 *          28.09.2018  2.10    Added support RX66T
 *                              Add WAIT_LOOP comments.
 *                              Fixed a bug that leaking memory in R_SCI_Open() when FIFO(async) enabled.
 *                              Fix GSCE Code Checker errors.
 *          01.02.2019  2.20    Added support RX72T, RX65N-64pin.
 *                              Fix GSCE Code Checker errors.
 *          20.05.2019  3.00    Added support for GNUC and ICCRX.
 *          28.06.2019  3.10    Added support for RX23W
 *          15.08.2019  3.20    Added support for RX72M
 *          25.11.2019  3.30    Added support RX13T.
 *                              Modified comment of API function to Doxygen style.
 *                              Added support for atomic control.
 *                              Fixed to comply with GSCE Coding Standards Rev.6.00.
 *                              Fixed a bug that error when a reception interrupt occurs before incrementing "u_tx_data.buf"
 *                               in "sci_send_sync_data" and "sci_receive" functions
 *          30.12.2019  3.40    Added support RX66N, RX72N.
 ***********************************************************************************************************************/

/*****************************************************************************
 * Includes   <System Includes> , "Project Includes"
 ******************************************************************************/
#include "platform.h"

/* Defines for SCI support */
#include "r_sci_rx_private.h"

/* Include specifics for chosen MCU.  */
#include "r_sci_rx_platform.h"

#if ( SCI_CFG_ASYNC_INCLUDED )
    #include "r_byteq_if.h"
#endif


/*****************************************************************************
 * Typedef definitions
 ******************************************************************************/

/*****************************************************************************
 * Macro definitions
 ******************************************************************************/

/*****************************************************************************
 * Private global variables and functions
 ******************************************************************************/
#if ( SCI_CFG_ASYNC_INCLUDED )
    static sci_err_t sci_init_async( sci_hdl_t const hdl,
                                     sci_uart_t * const p_cfg,
                                     uint8_t * const p_priority );

    static sci_err_t sci_init_queues( uint8_t const chan );

    static sci_err_t sci_send_async_data( sci_hdl_t const hdl,
                                          uint8_t * p_src,
                                          uint16_t const length );

    static byteq_err_t sci_put_byte( sci_hdl_t const hdl,
                                     uint8_t const byte );

    static void sci_transfer( sci_hdl_t const hdl );

    #if SCI_CFG_FIFO_INCLUDED
        static void sci_fifo_transfer( sci_hdl_t const hdl );
    #endif

    static sci_err_t sci_receive_async_data( sci_hdl_t const hdl,
                                             uint8_t * p_dst,
                                             uint16_t const length );
#endif /* if ( SCI_CFG_ASYNC_INCLUDED ) */

