FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
    /* INITIALIZE REGISTER */
    sci_init_register( g_handles[ chan ] );

    /* INITIALIZE MODE SPECIFIC FEATURES */
    g_handles[ chan ]->mode = mode;

    if( SCI_MODE_ASYNC == mode )
    {
        #if ( SCI_CFG_ASYNC_INCLUDED )
            /* Casting sci_cfg_t type to sci_uart_t type is valid */
            err = sci_init_async( g_handles[ chan ], ( sci_uart_t * ) p_cfg, &priority );
        #endif
    }
    else
    {
        #if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )
            /* Casting sci_cfg_t type to sci_sync_sspi_t type is valid */
            err = sci_init_sync( g_handles[ chan ], ( sci_sync_sspi_t * ) p_cfg, &priority );
        #endif
    }

    if( SCI_SUCCESS != err )
    {
        g_handles[ chan ]->mode = SCI_MODE_OFF;
        return err;
    }

    g_handles[ chan ]->callback = p_callback;

    /* INITIALIZE TX AND RX QUEUES */
    #if ( SCI_CFG_ASYNC_INCLUDED )
        if( SCI_MODE_ASYNC == mode )
        {
            err = sci_init_queues( chan );

            if( SCI_SUCCESS != err )
            {
                g_handles[ chan ]->mode = SCI_MODE_OFF;
                return err;
            }
        }
    #endif /* if ( SCI_CFG_ASYNC_INCLUDED ) */

    #if SCI_CFG_FIFO_INCLUDED
        if( true == g_handles[ chan ]->fifo_ctrl )
        {
            /* INITIALIZE TX AND RX FIFO */
            err = sci_init_fifo( g_handles[ chan ] );

            if( SCI_SUCCESS != err )
            {
                #if ( SCI_CFG_ASYNC_INCLUDED )
                    /* DE-INITIALIZE TX AND RX QUEUES */
                    if( SCI_MODE_ASYNC == mode )
                    {
                        R_BYTEQ_Close( g_handles[ chan ]->u_tx_data.que );
                        R_BYTEQ_Close( g_handles[ chan ]->u_rx_data.que );
                    }
                #endif
                g_handles[ chan ]->mode = SCI_MODE_OFF;
                return err;
            }
        }
    #endif /* if SCI_CFG_FIFO_INCLUDED */

    /* ENABLE INTERRUPTS */
    sci_initialize_ints( g_handles[ chan ], priority );

    /* FINISH */
    *p_hdl = g_handles[ chan ];

    return SCI_SUCCESS;
} /* End of function R_SCI_Open() */

/*****************************************************************************
 * Function Name: power_on
 * Description  : This function provides power to the channel referenced by
 *                the handle by taking it out of the module stop state.
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
static void power_on( sci_hdl_t const hdl )
{
    #if ( ( R_BSP_VERSION_MAJOR == 5 ) && ( R_BSP_VERSION_MINOR >= 30 ) ) || ( R_BSP_VERSION_MAJOR >= 6 )
        bsp_int_ctrl_t int_ctrl;
    #endif

    R_BSP_RegisterProtectDisable( BSP_REG_PROTECT_LPC_CGC_SWR );

    #if ( ( R_BSP_VERSION_MAJOR == 5 ) && ( R_BSP_VERSION_MINOR >= 30 ) ) || ( R_BSP_VERSION_MAJOR >= 6 )
        R_BSP_InterruptControl( BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl );
    #endif

    ( *hdl->rom->mstp ) &= ( ~hdl->rom->stop_mask );

    #if ( ( R_BSP_VERSION_MAJOR == 5 ) && ( R_BSP_VERSION_MINOR >= 30 ) ) || ( R_BSP_VERSION_MAJOR >= 6 )
        R_BSP_InterruptControl( BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl );
    #endif

    R_BSP_RegisterProtectEnable( BSP_REG_PROTECT_LPC_CGC_SWR );
} /* End of function power_on() */

/*****************************************************************************
 * Function Name: power_off
 * Description  : This function removes power to the channel referenced by
 *                handle by putting it into the module stop state.
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
static void power_off( sci_hdl_t const hdl )
{
    #if ( ( R_BSP_VERSION_MAJOR == 5 ) && ( R_BSP_VERSION_MINOR >= 30 ) ) || ( R_BSP_VERSION_MAJOR >= 6 )
        bsp_int_ctrl_t int_ctrl;
    #endif

    R_BSP_RegisterProtectDisable( BSP_REG_PROTECT_LPC_CGC_SWR );

    #if ( ( R_BSP_VERSION_MAJOR == 5 ) && ( R_BSP_VERSION_MINOR >= 30 ) ) || ( R_BSP_VERSION_MAJOR >= 6 )
        R_BSP_InterruptControl( BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl );
    #endif

    ( *hdl->rom->mstp ) |= ( hdl->rom->stop_mask );

    #if ( ( R_BSP_VERSION_MAJOR == 5 ) && ( R_BSP_VERSION_MINOR >= 30 ) ) || ( R_BSP_VERSION_MAJOR >= 6 )
        R_BSP_InterruptControl( BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl );
    #endif

    R_BSP_RegisterProtectEnable( BSP_REG_PROTECT_LPC_CGC_SWR );
} /* End of function power_off() */

#if ( SCI_CFG_ASYNC_INCLUDED )

/*****************************************************************************
 * Function Name: sci_init_queues
 * Description  : This function attaches transmit and receive queues to the
 *                channel.
 *
 * Arguments    : chan -
 *                    channel (ptr to chan control block)
 * Return Value : SCI_SUCCESS -
 *                    channel initialized successfully
 *                SCI_ERR_QUEUE_UNAVAILABLE -
 *                    no queue control blocks available
 ******************************************************************************/
    static sci_err_t sci_init_queues( uint8_t const chan )
    {
        byteq_err_t q_err1 = BYTEQ_ERR_INVALID_ARG;
        byteq_err_t q_err2 = BYTEQ_ERR_INVALID_ARG;
        sci_err_t err = SCI_SUCCESS;

        /* channel number verified as legal prior to calling this function */
        switch( chan )
        {
            #if SCI_CFG_CH0_INCLUDED
                case ( SCI_CH0 ):
                    q_err1 = R_BYTEQ_Open( ch0_tx_buf, SCI_CFG_CH0_TX_BUFSIZ, &g_handles[ SCI_CH0 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch0_rx_buf, SCI_CFG_CH0_RX_BUFSIZ, &g_handles[ SCI_CH0 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH1_INCLUDED
                case ( SCI_CH1 ):
                    q_err1 = R_BYTEQ_Open( ch1_tx_buf, SCI_CFG_CH1_TX_BUFSIZ, &g_handles[ SCI_CH1 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch1_rx_buf, SCI_CFG_CH1_RX_BUFSIZ, &g_handles[ SCI_CH1 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH2_INCLUDED
                case ( SCI_CH2 ):
                    q_err1 = R_BYTEQ_Open( ch2_tx_buf, SCI_CFG_CH2_TX_BUFSIZ, &g_handles[ SCI_CH2 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch2_rx_buf, SCI_CFG_CH2_RX_BUFSIZ, &g_handles[ SCI_CH2 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH3_INCLUDED
                case ( SCI_CH3 ):
                    q_err1 = R_BYTEQ_Open( ch3_tx_buf, SCI_CFG_CH3_TX_BUFSIZ, &g_handles[ SCI_CH3 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch3_rx_buf, SCI_CFG_CH3_RX_BUFSIZ, &g_handles[ SCI_CH3 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH4_INCLUDED
                case ( SCI_CH4 ):
                    q_err1 = R_BYTEQ_Open( ch4_tx_buf, SCI_CFG_CH4_TX_BUFSIZ, &g_handles[ SCI_CH4 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch4_rx_buf, SCI_CFG_CH4_RX_BUFSIZ, &g_handles[ SCI_CH4 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH5_INCLUDED
                case ( SCI_CH5 ):
                    q_err1 = R_BYTEQ_Open( ch5_tx_buf, SCI_CFG_CH5_TX_BUFSIZ, &g_handles[ SCI_CH5 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch5_rx_buf, SCI_CFG_CH5_RX_BUFSIZ, &g_handles[ SCI_CH5 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH6_INCLUDED
                case ( SCI_CH6 ):
                    q_err1 = R_BYTEQ_Open( ch6_tx_buf, SCI_CFG_CH6_TX_BUFSIZ, &g_handles[ SCI_CH6 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch6_rx_buf, SCI_CFG_CH6_RX_BUFSIZ, &g_handles[ SCI_CH6 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH7_INCLUDED
                case ( SCI_CH7 ):
                    q_err1 = R_BYTEQ_Open( ch7_tx_buf, SCI_CFG_CH7_TX_BUFSIZ, &g_handles[ SCI_CH7 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch7_rx_buf, SCI_CFG_CH7_RX_BUFSIZ, &g_handles[ SCI_CH7 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH8_INCLUDED
                case ( SCI_CH8 ):
                    q_err1 = R_BYTEQ_Open( ch8_tx_buf, SCI_CFG_CH8_TX_BUFSIZ, &g_handles[ SCI_CH8 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch8_rx_buf, SCI_CFG_CH8_RX_BUFSIZ, &g_handles[ SCI_CH8 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH9_INCLUDED
                case ( SCI_CH9 ):
                    q_err1 = R_BYTEQ_Open( ch9_tx_buf, SCI_CFG_CH9_TX_BUFSIZ, &g_handles[ SCI_CH9 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch9_rx_buf, SCI_CFG_CH9_RX_BUFSIZ, &g_handles[ SCI_CH9 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH10_INCLUDED
                case ( SCI_CH10 ):
                    q_err1 = R_BYTEQ_Open( ch10_tx_buf, SCI_CFG_CH10_TX_BUFSIZ, &g_handles[ SCI_CH10 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch10_rx_buf, SCI_CFG_CH10_RX_BUFSIZ, &g_handles[ SCI_CH10 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH11_INCLUDED
                case ( SCI_CH11 ):
                    q_err1 = R_BYTEQ_Open( ch11_tx_buf, SCI_CFG_CH11_TX_BUFSIZ, &g_handles[ SCI_CH11 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch11_rx_buf, SCI_CFG_CH11_RX_BUFSIZ, &g_handles[ SCI_CH11 ]->u_rx_data.que );
                    break;
            #endif
            #if SCI_CFG_CH12_INCLUDED
                case ( SCI_CH12 ):
                    q_err1 = R_BYTEQ_Open( ch12_tx_buf, SCI_CFG_CH12_TX_BUFSIZ, &g_handles[ SCI_CH12 ]->u_tx_data.que );
                    q_err2 = R_BYTEQ_Open( ch12_rx_buf, SCI_CFG_CH12_RX_BUFSIZ, &g_handles[ SCI_CH12 ]->u_rx_data.que );
                    break;
            #endif
            default:
                err = SCI_ERR_QUEUE_UNAVAILABLE;
                break;
        }

        if( ( BYTEQ_SUCCESS != q_err1 ) || ( BYTEQ_SUCCESS != q_err2 ) )
        {
            err = SCI_ERR_QUEUE_UNAVAILABLE;
        }

