FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
        return err;
    } /* End of function sci_init_queues() */
#endif /* End of SCI_CFG_ASYNC_INCLUDED */

#if SCI_CFG_FIFO_INCLUDED

/*****************************************************************************
 * Function Name: sci_init_fifo
 * Description  : This function the setting of the FIFO mode, reset of the
 *                TX/RX FIFO, and the threshold setting of the TX/RX FIFO.
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : SCI_SUCCESS -
 *                    fifo initialized successfully
 *                SCI_ERR_INVALID_ARG -
 *                    element of hdl contains illegal value
 ******************************************************************************/
    static sci_err_t sci_init_fifo( sci_hdl_t const hdl )
    {
        /* CHECK ARGUMENTS */
        #if SCI_CFG_PARAM_CHECKING_ENABLE
            if( hdl->tx_dflt_thresh > 15 )
            {
                return SCI_ERR_INVALID_ARG;
            }

            if( ( hdl->rx_dflt_thresh < 1 ) || ( hdl->rx_dflt_thresh > 15 ) )
            {
                return SCI_ERR_INVALID_ARG;
            }

            #if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )
                if( hdl->tx_dflt_thresh != hdl->rx_dflt_thresh )
                {
                    return SCI_ERR_INVALID_ARG;
                }
            #endif
        #endif /* if SCI_CFG_PARAM_CHECKING_ENABLE */

        /* FIFO Mode Select (1:FIFO mode) */
        hdl->rom->regs->FCR.BIT.FM = 0x01;

        /* reset TX/RX FIFO */
        hdl->rom->regs->FCR.BIT.TFRST = 0x01;
        hdl->rom->regs->FCR.BIT.RFRST = 0x01;

        /* set TX/RX FIFO threshold initial value */
        hdl->rom->regs->FCR.BIT.TTRG = hdl->tx_dflt_thresh;
        hdl->rom->regs->FCR.BIT.RTRG = hdl->rx_dflt_thresh;

        return SCI_SUCCESS;
    } /* End of function sci_init_fifo() */
#endif /* End of SCI_CFG_FIFO_INCLUDED */

#if ( SCI_CFG_ASYNC_INCLUDED )

/*****************************************************************************
 * Function Name: sci_init_async
 * Description  : This function initializes the control block and UART
 *                registers for an SCI channel.
 *
 * NOTE: p_cfg is checked to be non-NULL prior to this function.
 *       The TE and RE bits in SCR must be 0 prior to calling this function.
 *
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 *                p_cfg -
 *                    ptr to Uart configuration argument structure
 *                p_priority -
 *                    pointer to location to load interrupt priority into
 * Return Value : SCI_SUCCESS -
 *                    channel initialized successfully
 *                SCI_ERR_INVALID_ARG -
 *                    element of p_cfg contains illegal value
 ******************************************************************************/
    static sci_err_t sci_init_async( sci_hdl_t const hdl,
                                     sci_uart_t * const p_cfg,
                                     uint8_t * const p_priority )
    {
        sci_err_t err = SCI_SUCCESS;
        int32_t bit_err;

        /* Check arguments */

        #if SCI_CFG_PARAM_CHECKING_ENABLE
            if( ( ( SCI_DATA_8BIT != p_cfg->data_size ) && ( SCI_DATA_7BIT != p_cfg->data_size ) ) ||
                ( ( SCI_STOPBITS_1 != p_cfg->stop_bits ) && ( SCI_STOPBITS_2 != p_cfg->stop_bits ) ) ||
                ( ( p_cfg->int_priority < ( BSP_MCU_IPL_MIN + 1 ) ) || ( p_cfg->int_priority > BSP_MCU_IPL_MAX ) ) )
            {
                return SCI_ERR_INVALID_ARG;
            }

            if( SCI_PARITY_ON == p_cfg->parity_en )
            {
                if( ( SCI_EVEN_PARITY != p_cfg->parity_type ) && ( SCI_ODD_PARITY != p_cfg->parity_type ) )
                {
                    return SCI_ERR_INVALID_ARG;
                }
            }
            else if( SCI_PARITY_OFF != p_cfg->parity_en )
            {
                return SCI_ERR_INVALID_ARG;
            }
            else
            {
                /* Do Nothing */
            }

            if( SCI_CLK_INT == p_cfg->clk_src )
            {
                if( 0 == p_cfg->baud_rate )
                {
                    return SCI_ERR_INVALID_ARG;
                }
            }
            else if( ( SCI_CLK_EXT8X != p_cfg->clk_src ) && ( SCI_CLK_EXT16X != p_cfg->clk_src ) )
            {
                return SCI_ERR_INVALID_ARG;
            }
            else
            {
                /* Do Nothing */
            }
        #endif /* End of SCI_CFG_PARAM_CHECKING_ENABLE */


        /* Initialize channel control block flags */
        hdl->tx_idle = true;

        /* Configure SMR for asynchronous mode, single processor, and user settings */
        if( SCI_PARITY_OFF == p_cfg->parity_en )
        {
            p_cfg->parity_type = 0;     /* ensure random value is not ORed into SMR */
        }

        /* Configure SMR */
        hdl->rom->regs->SMR.BYTE = ( uint8_t ) ( ( p_cfg->data_size | p_cfg->stop_bits ) | ( p_cfg->parity_en | p_cfg->parity_type ) );

        /* SETUP CLOCK FOR BAUD RATE */

        if( SCI_CLK_INT == p_cfg->clk_src )
        {
            /* Use internal clock for baud rate */
            bit_err = sci_init_bit_rate( hdl, hdl->pclk_speed, p_cfg->baud_rate );

            if( 1000 == bit_err )
            {
                err = SCI_ERR_INVALID_ARG;      /* impossible baud rate; 100% error */
            }
            else
            {
                hdl->baud_rate = p_cfg->baud_rate; /* save baud rate for break generation */
            }
        }
        else
        {
            /* Use external clock for baud rate */
            hdl->rom->regs->SCR.BIT.CKE = 0x02;
            hdl->rom->regs->SEMR.BIT.ABCS = ( SCI_CLK_EXT8X == p_cfg->clk_src ) ? 1 : 0;
        }

        *p_priority = p_cfg->int_priority;
        return err;
    } /* End of function sci_init_async() */
#endif /* End of SCI_CFG_ASYNC_INCLUDED */

