FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
#if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )

/*****************************************************************************
 * Function Name: sci_init_sync
 * Description  : This function initializes the control block and SYNC/SSPI
 *                registers for an SCI channel.
 *
 * NOTE: p_cfg is checked to be non-NULL prior to this function.
 *       The TE and RE bits in SCR must be 0 prior to calling this function.
 *
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 *                p_cfg -
 *                    ptr to SSPI configuration argument structure
 *                p_priority -
 *                    pointer to location to load interrupt priority into
 * Return Value : SCI_SUCCESS -
 *                    channel initialized successfully
 *                SCI_ERR_INVALID_ARG -
 *                    element of p_cfg contains illegal value
 ******************************************************************************/
    static sci_err_t sci_init_sync( sci_hdl_t const hdl,
                                    sci_sync_sspi_t * const p_cfg,
                                    uint8_t * const p_priority )
    {
        sci_err_t err = SCI_SUCCESS;
        int32_t bit_err;


        /* Check arguments */

        #if SCI_CFG_PARAM_CHECKING_ENABLE
            if( ( SCI_MODE_SSPI == hdl->mode ) &&
                ( SCI_SPI_MODE_0 != p_cfg->spi_mode ) && ( SCI_SPI_MODE_1 != p_cfg->spi_mode ) &&
                ( SCI_SPI_MODE_2 != p_cfg->spi_mode ) && ( SCI_SPI_MODE_3 != p_cfg->spi_mode ) )
            {
                return SCI_ERR_INVALID_ARG;
            }
            else if( ( SCI_MODE_SYNC == hdl->mode ) && ( SCI_SPI_MODE_OFF != p_cfg->spi_mode ) )
            {
                return SCI_ERR_INVALID_ARG;
            }
            else
            {
                /* Do Nothing */
            }

            if( 0 == p_cfg->bit_rate )
            {
                return SCI_ERR_INVALID_ARG;
            }

            if( ( 0 == p_cfg->int_priority ) || ( p_cfg->int_priority > BSP_MCU_IPL_MAX ) )
            {
                return SCI_ERR_INVALID_ARG;
            }
        #endif /* if SCI_CFG_PARAM_CHECKING_ENABLE */

        /* Initialize channel control block flags */
        hdl->tx_idle = true;
        hdl->tx_dummy = false;

        /* Configure SMR for SSPI/SYNC mode */
        hdl->rom->regs->SMR.BYTE = 0x80;
        hdl->rom->regs->SCMR.BIT.SMIF = 0;      /* default */
        hdl->rom->regs->SIMR1.BIT.IICM = 0;     /* default */

        /* Configure SPI register for clock polarity/phase and single master */
        if( SCI_MODE_SSPI == hdl->mode )
        {
            hdl->rom->regs->SPMR.BYTE = p_cfg->spi_mode;
        }
        else /* synchronous operation */
        {
            hdl->rom->regs->SPMR.BYTE = 0;
        }

        /* Configure data inversion */
        hdl->rom->regs->SCMR.BIT.SINV = ( uint8_t ) ( ( true == p_cfg->invert_data ) ? 1 : 0 );

        /* Configure bit order */
        hdl->rom->regs->SCMR.BIT.SDIR = ( uint8_t ) ( ( true == p_cfg->msb_first ) ? 1 : 0 );


        /* SETUP CLOCK FOR BIT RATE */

        /* Use internal clock for bit rate (master) */
        bit_err = sci_init_bit_rate( hdl, hdl->pclk_speed, p_cfg->bit_rate );

        if( 1000 == bit_err )
        {
            err = SCI_ERR_INVALID_ARG;  /* impossible bit rate; 100% error */
        }

        *p_priority = p_cfg->int_priority;
        return err;
    } /* End of function sci_init_sync() */
#endif /* End of SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */

/***********************************************************************************************************************
 * Function Name: R_SCI_Send
 ********************************************************************************************************************//**
 * @brief  Initiates transmit if transmitter is not in use. Queues data for later transmit when in Asynchronous mode.
 *
 * @param[in]    hdl  Handle for channel. Set hdl when R_SCI_Open() is successfully processed.
 *
 * @param[in]    p_src  Pointer to data to transmit
 *
 * @param[in]    length  Number of bytes to send
 *
 * @retval   SCI_SUCCESS  Transmit initiated or loaded into queue (Asynchronous)
 *
 * @retval   SCI_ERR_NULL_PTR  hdl value is NULL
 *
 * @retval   SCI_ERR_BAD_MODE  Mode specified not currently supported
 *
 * @retval   SCI_ERR_INSUFFICIENT_SPACE  Insufficient space in queue to load all data (Asynchronous)
 *
 * @retval   SCI_ERR_XCVR_BUSY  Channel currently busy (SSPI/Synchronous)
 *
 *
 * @details  In asynchronous mode, this function places data into a transmit queue if the transmitter for the SCI channel
 * referenced by the handle is not in use. In SSPI and Synchronous modes, no data is queued and transmission begins immediately
 * if the transceiver is not already in use. All transmissions are handled at the interrupt level.\n
 * Note that the toggling of Slave Select lines when in SSPI mode is not handled by this driver. The Slave Select line
 * for the target device must be enabled prior to calling this function.
 * Also, toggling of the CTS/RTS pin in Synchronous/Asynchronous mode is not handled by this driver.
 * @note None
 */
sci_err_t R_SCI_Send( sci_hdl_t const hdl,
                      uint8_t * p_src,
                      uint16_t const length )
{
    sci_err_t err = SCI_SUCCESS;

    /* Check arguments */

    #if SCI_CFG_PARAM_CHECKING_ENABLE
        /* Check argument hdl, p_src */
        if( ( ( NULL == hdl ) || ( FIT_NO_PTR == hdl ) ) || ( ( NULL == p_src ) || ( FIT_NO_PTR == p_src ) ) )
        {
            return SCI_ERR_NULL_PTR;
        }

        if( ( SCI_MODE_OFF == hdl->mode ) || ( SCI_MODE_MAX <= hdl->mode ) )
        {
            return SCI_ERR_BAD_MODE;
        }

        if( 0 == length )
        {
            return SCI_ERR_INVALID_ARG;
        }
    #endif /* if SCI_CFG_PARAM_CHECKING_ENABLE */

    if( SCI_MODE_ASYNC == hdl->mode )
    {
        #if ( SCI_CFG_ASYNC_INCLUDED )
            err = sci_send_async_data( hdl, p_src, length );
        #endif
    }
    else
    {
        /* SSPI or SYNC */
        #if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )
            err = sci_send_sync_data( hdl, p_src, NULL, length, false );
        #endif
    }

