FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
    return err;
} /* End of function R_SCI_Send() */


#if ( SCI_CFG_ASYNC_INCLUDED )

/*****************************************************************************
 * Function Name: sci_send_async_data
 * Description  : This function determines if the tx byte queue of the channel
 *                referenced by the handle is not full, and call the byte
 *                transmission function.
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 *                p_src -
 *                    ptr to data to transmit
 *                length -
 *                    number of bytes to send and possibly receive
 * Return Value : SCI_SUCCESS -
 *                    data transfer started
 *                SCI_ERR_XCVR_BUSY -
 *                    channel currently busy
 *                SCI_ERR_INSUFFICIENT_SPACE -
 *                    not enough space in tx queue to store data (Async)
 ******************************************************************************/
    static sci_err_t sci_send_async_data( sci_hdl_t const hdl,
                                          uint8_t * p_src,
                                          uint16_t const length )
    {
        sci_err_t err = SCI_SUCCESS;
        uint16_t cnt;
        byteq_err_t byteq_err = BYTEQ_ERR_QUEUE_FULL;

        if( true != hdl->tx_idle )
        {
            return SCI_ERR_XCVR_BUSY;
        }

        #if SCI_CFG_FIFO_INCLUDED
            if( true == hdl->fifo_ctrl )
            {
                /* TX FIFO use check */
                if( 0x00 < hdl->rom->regs->FDR.BIT.T )
                {
                    return SCI_ERR_XCVR_BUSY;
                }

                /* reset TX FIFO */
                hdl->rom->regs->FCR.BIT.TFRST = 0x01;
            }
        #endif /* if SCI_CFG_FIFO_INCLUDED */

        /* Determine amount of space left in tx queue */
        R_BYTEQ_Unused( hdl->u_tx_data.que, &cnt );

        if( cnt < length )
        {
            /* If can't fit, return */
            return SCI_ERR_INSUFFICIENT_SPACE;
        }

        /* Else load bytes into tx queue for transmission */
        /* WAIT_LOOP */
        for( cnt = 0; cnt < length; cnt++ )
        {
            byteq_err = sci_put_byte( hdl, *p_src++ );

            if( BYTEQ_SUCCESS != byteq_err )
            {
                /* If the return value is not BYTEQ_SUCCESS. */
                err = SCI_ERR_INSUFFICIENT_SPACE;
                break;
            }
        }

        if( SCI_SUCCESS == err )
        {
            hdl->tx_idle = false;
            ENABLE_TXI_INT;
        }

        return err;
    } /* End of function sci_send_async_data() */

/*****************************************************************************
 * Function Name: sci_put_byte
 * Description  : Transmits byte if channel is not busy. Otherwise, byte is
 *                stored in tx queue until can transmit. If buffer is full
 *                and cannot store it, an error code is returned.
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 *                byte -
 *                    byte to transmit
 * Return Value : SCI_SUCCESS -
 *                    data transfer started
 *                SCI_ERR_INSUFFICIENT_SPACE -
 *                    not enough space in tx queue to store data (Async)
 ******************************************************************************/
    static byteq_err_t sci_put_byte( sci_hdl_t const hdl,
                                     uint8_t const byte )
    {
        byteq_err_t err = BYTEQ_ERR_QUEUE_FULL;

        /* else load next byte into tx queue (space checked in calling func) */
        err = R_BYTEQ_Put( hdl->u_tx_data.que, byte );

        return err;
    } /* End of function sci_put_byte() */
#endif /* SCI_CFG_ASYNC_INCLUDED */


#if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )

/*****************************************************************************
 * Function Name: sci_send_sync_data
 * Description  : This function determines if the channel referenced by the
 *                handle is not busy, and begins the data transfer process
 *                (both sending and receiving data).
 *
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 *                p_src -
 *                    ptr to data to transmit
 *                p_dst -
 *                    ptr to buffer to store receive data (optional)
 *                length -
 *                    number of bytes to send and possibly receive
 *                save_rx_data -
 *                    true if data clocked in should be saved to p_dst.
 * Return Value : SCI_SUCCESS -
 *                    data transfer started
 *                SCI_ERR_XCVR_BUSY -
 *                    channel currently busy
 ******************************************************************************/
    static sci_err_t sci_send_sync_data( sci_hdl_t const hdl,
                                         uint8_t * p_src,
                                         uint8_t * p_dst,
                                         uint16_t const length,
                                         bool save_rx_data )
    {
        #if SCI_CFG_FIFO_INCLUDED
            uint8_t cnt;
            uint8_t thresh_cnt;
        #endif

        if( true == hdl->tx_idle )
        {
            if( true == save_rx_data )
            {
                hdl->u_rx_data.buf = p_dst;
            }

            hdl->save_rx_data = save_rx_data;

            hdl->u_tx_data.buf = p_src;
            hdl->tx_cnt = length;
            hdl->rx_cnt = length;
            hdl->tx_idle = false;
            hdl->tx_dummy = false;

            #if SCI_CFG_FIFO_INCLUDED
                if( true == hdl->fifo_ctrl )
                {
                    /* reset TX FIFO */
                    hdl->rom->regs->FCR.BIT.TFRST = 0x01;

                    /* reset RX FIFO */
                    hdl->rom->regs->FCR.BIT.RFRST = 0x01;

                    /* If length is lower than SCI_CFG_CHXX_RX_FIFO_THRESH, FCR.BIT.RTRG register is set to length */
                    if( length < hdl->rx_curr_thresh )
                    {
                        hdl->rom->regs->FCR.BIT.RTRG = length;
                    }

