FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
                    thresh_cnt = hdl->rom->regs->FCR.BIT.RTRG;

                    hdl->tx_cnt -= thresh_cnt;

                    /* Repeated FIFO RX threshold count */
                    /* WAIT_LOOP */
                    for( cnt = 0; cnt < thresh_cnt; cnt++ )
                    {
                        if( 0 != cnt )
                        {
                            hdl->u_tx_data.buf++;
                        }

                        SCI_TDR( *hdl->u_tx_data.buf ); /* start transmit */
                    }
                }
                else
            #endif /* if SCI_CFG_FIFO_INCLUDED */
            {
                hdl->tx_cnt--;
                SCI_TDR( *hdl->u_tx_data.buf ); /* start transmit */
            }

            return SCI_SUCCESS;
        }

        return SCI_ERR_XCVR_BUSY;
    } /* End of function sci_send_sync_data() */
#endif /* SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */


#if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )

/***********************************************************************************************************************
 * Function Name: R_SCI_SendReceive
 ********************************************************************************************************************//**
 * @brief  For Synchronous and SSPI modes only. Transmits and receives data simultaneously if the transceiver is not
 * in use.
 *
 * @param[in]    hdl  Handle for channel. Set hdl when R_SCI_Open() is successfully processed.
 * @param[in]    p_src  Pointer to data to transmit
 *
 * @param[in]    p_dst  Pointer to buffer to load data into
 *
 * @param[in]    length  Number of bytes to send
 *
 * @retval   SCI_SUCCESS  Data transfer initiated
 *
 * @retval   SCI_ERR_NULL_PTR  hdl value is NULL
 *
 * @retval   SCI_ERR_BAD_MODE  Channel mode not SSPI or Synchronous
 *
 * @retval   SCI_ERR_XCVR_BUSY  Channel currently busy
 * @details   If the transceiver is not in use, this function clocks out data from the p_src buffer while simultaneously
 * clocking in data and placing it in the p_dst buffer.
 * Note that the toggling of Slave Select lines for SSPI is not handled by this driver. The Slave Select line for
 * the target device must be enabled prior to calling this function.
 * Also, toggling of the CTS/RTS pin in Synchronous/Asynchronous mode is not handled by this driver.
 *
 * @note See section 2.11 Callback Function in application note for values passed to arguments of the callback function.
 */
    sci_err_t R_SCI_SendReceive( sci_hdl_t const hdl,
                                 uint8_t * p_src,
                                 uint8_t * p_dst,
                                 uint16_t const length )
    {
        sci_err_t err;

        #if SCI_CFG_PARAM_CHECKING_ENABLE
            /* Check arguments */
            if( ( ( ( NULL == hdl ) || ( FIT_NO_PTR == hdl ) ) ||  /* Check if hdl is available or not   */
                  ( ( NULL == p_src ) || ( FIT_NO_PTR == p_src ) ) ) || /* Check if p_src is available or not */
                ( ( NULL == p_dst ) || ( FIT_NO_PTR == p_dst ) ) ) /* Check if p_dst is available or not */
            {
                return SCI_ERR_NULL_PTR;
            }

            if( ( SCI_MODE_SSPI != hdl->mode ) && ( SCI_MODE_SYNC != hdl->mode ) )
            {
                return SCI_ERR_BAD_MODE;
            }

            if( 0 == length )
            {
                return SCI_ERR_INVALID_ARG;
            }
        #endif /* if SCI_CFG_PARAM_CHECKING_ENABLE */

        err = sci_send_sync_data( hdl, p_src, p_dst, length, true );

        return err;
    } /* End of function R_SCI_SendReceive() */
#endif /* End of SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */

#if ( SCI_CFG_ASYNC_INCLUDED )

/*****************************************************************************
 * Function Name: sci_transfer
 * Description  : Transfer for SCI
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
    static void sci_transfer( sci_hdl_t const hdl )
    {
        uint16_t num;
        uint8_t byte;

        /* Get bytes from tx queue */
        ( void ) R_BYTEQ_Get( hdl->u_tx_data.que, ( uint8_t * ) &byte );

        /* TDR/FTDR register write access */
        SCI_TDR( byte );

        /* Get data byte number from que and if the number of data bytes is 0, to disable the transfer */
        R_BYTEQ_Used( hdl->u_tx_data.que, &num );

        if( 0 >= num )
        {
            /* Disable transmit interrupt */
            DISABLE_TXI_INT;
            #if SCI_CFG_TEI_INCLUDED
                /* Enable transmit end interrupt */
                hdl->rom->regs->SCR.BIT.TEIE = 1;
                ENABLE_TEI_INT;
            #endif
            hdl->tx_idle = true; /* set flag if queue empty */
        }
    } /* End of function sci_transfer() */

    #if SCI_CFG_FIFO_INCLUDED

/*****************************************************************************
 * Function Name: sci_fifo_transfer
 * Description  : FIFO Transfer for SCI
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
        static void sci_fifo_transfer( sci_hdl_t const hdl )
        {
            uint8_t cnt;
            uint8_t fifo_num;

            /* Repeated empty FIFO buffer count */
            fifo_num = SCI_FIFO_FRAME_SIZE - hdl->rom->regs->FDR.BIT.T;

            /* WAIT_LOOP */
            for( cnt = 0; cnt < fifo_num; cnt++ )
            {
                /* SCI Transfer */
                sci_transfer( hdl );

                /* If the queue is empty(true == hdl->tx_idle), exit from FIFO transfer loop */
                if( true == hdl->tx_idle )
                {
                    break;
                }
            }

            /* When the settings of transmit data are completed, set the SSRFIFO.TDFE flag to 0. */
            if( 1 == hdl->rom->regs->SSRFIFO.BIT.TDFE )
            {
                /* Casting register 8 bits to unsigned char type is valid */
                hdl->rom->regs->SSRFIFO.BYTE = ( unsigned char ) ~SCI_SSRFIFO_TDFE_MASK;
            }
        } /* End of function sci_fifo_transfer() */
    #endif /*End of SCI_CFG_FIFO_INCLUDED */

/*****************************************************************************
 * Function Name: txi_handler
 * Description  : TXI interrupt handler for SCI
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
    void txi_handler( sci_hdl_t const hdl )
    {
        #if SCI_CFG_FIFO_INCLUDED
            if( true == hdl->fifo_ctrl )
            {
                /* SCI FIFO Transfer */
                sci_fifo_transfer( hdl );
            }
            else
        #endif
        {
            /* SCI Transfer */
            sci_transfer( hdl );
        }
    } /* End of function txi_handler() */
#endif /* SCI_CFG_ASYNC_INCLUDED */


#if SCI_CFG_TEI_INCLUDED

/*****************************************************************************
 * Function Name: tei_handler
 * Description  : TEI interrupt handler for SCI
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
    void tei_handler( sci_hdl_t const hdl )
    {
        sci_cb_args_t args;

        /* Disable transmit end interrupt */
        DISABLE_TEI_INT;
        hdl->rom->regs->SCR.BIT.TEIE = 0;

        /* Activate callback function if available */
        if( ( NULL != hdl->callback ) && ( FIT_NO_FUNC != hdl->callback ) )
        {
            args.hdl = hdl;
            args.event = SCI_EVT_TEI;

            /* Activate callback function */
            hdl->callback( ( void * ) &args );
        }
    } /* End of function tei_handler() */
#endif /* if SCI_CFG_TEI_INCLUDED */


