FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
/***********************************************************************************************************************
 * Function Name: R_SCI_Receive
 ********************************************************************************************************************//**
 * @brief In Asynchronous mode, fetches data from a queue which is filled by RXI interrupts. In other modes, initiates
 * reception if transceiver is not in use.
 * @param[in]    hdl Handle for channel. Set hdl when R_SCI_Open() is successfully processed.
 *
 * @param[in]    p_dst  Pointer to buffer to load data into
 *
 * @param[in]    length  Number of bytes to read
 *
 * @retval SCI_SUCCESS  Requested number of bytes were loaded into p_dst (Asynchronous) Clocking in of data initiated
 * (SSPI/Synchronous)
 *
 * @retval SCI_ERR_NULL_PTR  hdl value is NULL
 *
 * @retval SCI_ERR_BAD_MODE  Mode specified not currently supported
 *
 * @retval SCI_ERR_INSUFFICIENT_DATA  Insufficient data in receive queue to fetch all data (Asynchronous)
 *
 * @retval SCI_ERR_XCVR_BUSY  Channel currently busy (SSPI/Synchronous)
 *
 * @details In Asynchronous mode, this function gets data received on an SCI channel referenced by the handle from its
 * receive queue. This function will not block if the requested number of bytes is not available. In
 * SSPI/Synchronous modes, the clocking in of data begins immediately if the transceiver is not already in use.
 * The value assigned to SCI_CFG_DUMMY_TX_BYTE in r_sci_config.h is clocked out while the receive data is being clocked in.\n
 * If any errors occurred during reception, the callback function specified in R_SCI_Open() is executed. Check
 * an event passed with the argument of the callback function to see if the reception has been successfully
 * completed. See Section 2.11 Callback Function in application note for details.\n
 * Note that the toggling of Slave Select lines when in SSPI mode is not handled by this driver. The Slave
 * Select line for the target device must be enabled prior to calling this function.
 * @note See section 2.11 Callback Function in application note for values passed to arguments of the callback function.
 * In Asynchronous mode, when data match detected, received data stored in a queue and notify to user by callback function
 * with event SCI_EVT_RX_CHAR_MATCH.
 */
sci_err_t R_SCI_Receive( sci_hdl_t const hdl,
                         uint8_t * p_dst,
                         uint16_t const length )
{
    sci_err_t err = SCI_SUCCESS;


    /* Check arguments */

    #if SCI_CFG_PARAM_CHECKING_ENABLE
        /* Check argument hdl, p_dst */
        if( ( ( NULL == hdl ) || ( FIT_NO_PTR == hdl ) ) || ( ( NULL == p_dst ) || ( FIT_NO_PTR == p_dst ) ) )
        {
            return SCI_ERR_NULL_PTR;
        }

        if( ( SCI_MODE_OFF == hdl->mode ) || ( SCI_MODE_MAX <= hdl->mode ) )
        {
            return SCI_ERR_BAD_MODE;
        }

        if( 0 == length )
        {
            return SCI_ERR_INVALID_ARG;
        }
    #endif /* if SCI_CFG_PARAM_CHECKING_ENABLE */

    if( SCI_MODE_ASYNC == hdl->mode )
    {
        #if ( SCI_CFG_ASYNC_INCLUDED )
            err = sci_receive_async_data( hdl, p_dst, length );
        #endif
    }

    else
    {
        /* mode is SSPI/SYNC */
        #if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )
            err = sci_receive_sync_data( hdl, p_dst, length );
        #endif
    }

    return err;
} /* End of function R_SCI_Receive() */

#if ( SCI_CFG_ASYNC_INCLUDED )

/*****************************************************************************
 * Function Name: sci_receive_async_data
 * Description  : This function determines if the rx byte queue of the channel
 *                referenced by the handle, the requested number of bytes
 *                is available, and get the data from the rx byte queue.
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 *                p_dst -
 *                    ptr to buffer to load data into
 *                length -
 *                    number of bytes to read
 * Return Value : SCI_SUCCESS -
 *                    requested number of byte loaded into p_dst
 *                SCI_ERR_INSUFFICIENT_DATA -
 *                    rx queue does not contain requested amount of data
 ******************************************************************************/
    static sci_err_t sci_receive_async_data( sci_hdl_t const hdl,
                                             uint8_t * p_dst,
                                             uint16_t const length )
    {
        sci_err_t err = SCI_SUCCESS;
        uint16_t cnt;
        byteq_err_t byteq_err = BYTEQ_SUCCESS;

        /* CHECK FOR SUFFICIENT DATA IN QUEUE, AND FETCH IF AVAILABLE */
        R_BYTEQ_Used( hdl->u_rx_data.que, &cnt );

        if( cnt < length )
        {
            return SCI_ERR_INSUFFICIENT_DATA;
        }

        /* Get bytes from rx queue */
        /* WAIT_LOOP */
        for( cnt = 0; cnt < length; cnt++ )
        {
            /* Disable RXI Interrupt */
            DISABLE_RXI_INT;
            byteq_err = R_BYTEQ_Get( hdl->u_rx_data.que, p_dst++ );
            ENABLE_RXI_INT;

            if( BYTEQ_SUCCESS != byteq_err )
            {
                err = SCI_ERR_INSUFFICIENT_DATA;
                break;
            }
        }

        return err;
    } /* End of function sci_receive_async_data() */
#endif /* SCI_CFG_ASYNC_INCLUDED */

#if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )

/*****************************************************************************
 * Function Name: sci_receive_sync_data
 * Description  : This function determines if the channel referenced by the
 *                handle is not busy, and dummy data send.
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 *                p_dst -
 *                    ptr to buffer to load data into
 *                length -
 *                    number of bytes to read
 * Return Value : SCI_SUCCESS -
 *                    requested number of byte loaded into p_dst
 *                SCI_ERR_XCVR_BUSY -
 *                    channel currently busy
 ******************************************************************************/
    static sci_err_t sci_receive_sync_data( sci_hdl_t const hdl,
                                            uint8_t * p_dst,
                                            uint16_t const length )
    {
        #if SCI_CFG_FIFO_INCLUDED
            uint8_t cnt;
            uint8_t thresh_cnt;
        #endif

