FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
        /* IF TRANCEIVER NOT IN USE, START DUMMY TRANSMIT TO CLOCK IN DATA */
        if( true == hdl->tx_idle )
        {
            hdl->u_rx_data.buf = p_dst;
            hdl->save_rx_data = true;            /* save the data clocked in */
            hdl->tx_idle = false;
            hdl->tx_cnt = length;
            hdl->rx_cnt = length;
            hdl->tx_dummy = true;

            #if SCI_CFG_FIFO_INCLUDED
                if( true == hdl->fifo_ctrl )
                {
                    /* reset TX FIFO */
                    hdl->rom->regs->FCR.BIT.TFRST = 0x01;

                    /* reset RX FIFO */
                    hdl->rom->regs->FCR.BIT.RFRST = 0x01;

                    if( length > SCI_FIFO_FRAME_SIZE )
                    {
                        thresh_cnt = SCI_FIFO_FRAME_SIZE;
                    }
                    else
                    {
                        /* If length is lower than SCI_CFG_CHXX_RX_FIFO_THRESH, FCR.BIT.RTRG register is set to length */
                        if( length < hdl->rx_curr_thresh )
                        {
                            hdl->rom->regs->FCR.BIT.RTRG = length;
                        }

                        thresh_cnt = length;
                    }

                    hdl->tx_cnt -= thresh_cnt;

                    /* WAIT_LOOP */
                    for( cnt = 0; cnt < thresh_cnt; cnt++ )
                    {
                        SCI_TDR( SCI_CFG_DUMMY_TX_BYTE ); /* start transmit */
                    }
                }
                else
            #endif /* End of SCI_CFG_FIFO_INCLUDED */
            {
                hdl->tx_cnt--;
                SCI_TDR( SCI_CFG_DUMMY_TX_BYTE ); /* start transfer */
            }

            return SCI_SUCCESS;
        }

        return SCI_ERR_XCVR_BUSY;
    } /* End of function sci_receive_sync_data() */
#endif /* End of SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */

/*****************************************************************************
 * Function Name: sci_receive
 * Description  : Receive for SCI
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
static void sci_receive( sci_hdl_t const hdl )
{
    sci_cb_args_t args;
    uint8_t byte;

    /* Read byte */
    SCI_RDR( byte );

    if( SCI_MODE_ASYNC == hdl->mode )
    {
        #if ( SCI_CFG_ASYNC_INCLUDED )
            /* Place byte in queue */
            if( R_BYTEQ_Put( hdl->u_rx_data.que, byte ) == BYTEQ_SUCCESS )
            {
                args.event = SCI_EVT_RX_CHAR;
            }
            else
            {
                args.event = SCI_EVT_RXBUF_OVFL;
            }

            /* Do callback if available */
            if( ( NULL != hdl->callback ) && ( FIT_NO_FUNC != hdl->callback ) )
            {
                args.hdl = hdl;
                args.byte = byte;

                /* Casting to void type is valid */
                hdl->callback( ( void * ) &args );
            }
        #endif /* if ( SCI_CFG_ASYNC_INCLUDED ) */
    }
    else
    {
        #if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )
            hdl->rx_cnt--;

            /* Place byte in buffer if Receive() or SendReceive() */
            if( true == hdl->save_rx_data )
            {
                *hdl->u_rx_data.buf++ = byte;
            }

            /* See if more bytes to transfer */
            if( 0 < hdl->rx_cnt )
            {
                if( 0 < hdl->tx_cnt )
                {
                    /* send another byte */
                    if( true == hdl->tx_dummy )
                    {
                        hdl->tx_cnt--;
                        SCI_TDR( SCI_CFG_DUMMY_TX_BYTE );
                    }
                    else
                    {
                        hdl->tx_cnt--;
                        hdl->u_tx_data.buf++;
                        SCI_TDR( *hdl->u_tx_data.buf );
                    }
                }
            }
            else
            {
                hdl->tx_idle = true;

                /* Do callback if available */
                if( ( NULL != hdl->callback ) && ( FIT_NO_FUNC != hdl->callback ) )
                {
                    args.hdl = hdl;
                    args.event = SCI_EVT_XFER_DONE;

                    /* Casting to void type is valid */
                    hdl->callback( ( void * ) &args );
                }
            }
        #endif /* End of SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */
    }
} /* End of function sci_receive() */

#if SCI_CFG_FIFO_INCLUDED
    #if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )

/*****************************************************************************
 * Function Name: sci_fifo_receive_sync
 * Description  : FIFO Receive for SCI mode is SYNC and SSPI
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
        static void sci_fifo_receive_sync( sci_hdl_t const hdl )
        {
            uint8_t cnt;
            uint8_t fifo_num_rx;
            uint8_t fifo_num_tx;
            sci_cb_args_t args;
            uint8_t byte_rx[ SCI_FIFO_FRAME_SIZE ];

            fifo_num_rx = hdl->rom->regs->FDR.BIT.R;

            /* WAIT_LOOP */
            for( cnt = 0; cnt < fifo_num_rx; cnt++ )
            {
                SCI_RDR( byte_rx[ cnt ] );
            }

            hdl->rx_cnt -= fifo_num_rx;

            /* Place byte in buffer if Receive() or SendReceive() */
            if( true == hdl->save_rx_data )
            {
                /* WAIT_LOOP */
                for( cnt = 0; cnt < fifo_num_rx; cnt++ )
                {
                    /* SCI Receive */
                    *hdl->u_rx_data.buf++ = byte_rx[ cnt ];
                }
            }

            /* See if more bytes to transfer */
            if( 0 < hdl->rx_cnt )
            {
                if( hdl->rom->regs->FCR.BIT.RTRG > hdl->rx_cnt )
                {
                    hdl->rom->regs->FCR.BIT.RTRG = hdl->rx_cnt;
                }

