FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
                if( 0 < hdl->tx_cnt )
                {
                    if( hdl->tx_cnt > fifo_num_rx )
                    {
                        fifo_num_tx = fifo_num_rx;
                        hdl->tx_cnt -= fifo_num_rx;
                    }
                    else
                    {
                        fifo_num_tx = hdl->tx_cnt;
                        hdl->tx_cnt = 0;
                    }

                    /* send another byte */
                    if( true == hdl->tx_dummy )
                    {
                        /* WAIT_LOOP */
                        for( cnt = 0; cnt < fifo_num_tx; cnt++ )
                        {
                            SCI_TDR( SCI_CFG_DUMMY_TX_BYTE );
                        }
                    }
                    else
                    {
                        /* WAIT_LOOP */
                        for( cnt = 0; cnt < fifo_num_tx; cnt++ )
                        {
                            hdl->u_tx_data.buf++;
                            SCI_TDR( *hdl->u_tx_data.buf );
                        }
                    }
                }
            }
            else
            {
                hdl->rom->regs->FCR.BIT.RTRG = hdl->rx_curr_thresh;
                hdl->tx_idle = true;

                /* Do callback if available */
                if( ( NULL != hdl->callback ) && ( FIT_NO_FUNC != hdl->callback ) )
                {
                    args.hdl = hdl;
                    args.event = SCI_EVT_XFER_DONE;

                    /* Casting pointer to void* type is valid */
                    hdl->callback( ( void * ) &args );
                }
            }
        } /* End of function sci_fifo_receive_sync() */
    #endif /* End of SCI_CFG_FIFO_INCLUDED */
#endif /* End of SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED */

#if SCI_CFG_FIFO_INCLUDED

/*****************************************************************************
 * Function Name: sci_fifo_receive
 * Description  : FIFO Receive for SCI
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
    static void sci_fifo_receive( sci_hdl_t const hdl )
    {
        #if ( SCI_CFG_ASYNC_INCLUDED )
            uint16_t cnt;
            uint16_t fifo_num;
            sci_cb_args_t args;
            uint8_t byte_rx[ SCI_FIFO_FRAME_SIZE ];
        #endif

        if( SCI_MODE_ASYNC == hdl->mode )
        {
            #if ( SCI_CFG_ASYNC_INCLUDED )
                /* Casting unsigned char type to uint16_t type is valid */
                fifo_num = ( uint16_t ) hdl->rom->regs->FDR.BIT.R;

                /* RX FIFO flush */
                /* WAIT_LOOP */
                for( cnt = 0; cnt < fifo_num; cnt++ )
                {
                    /* Read byte */
                    SCI_RDR( byte_rx[ cnt ] );
                }

                /* Determine amount of space left in rx queue */
                ( void ) R_BYTEQ_Unused( hdl->u_rx_data.que, &cnt );

                if( cnt >= fifo_num )
                {
                    /* free space is enough */
                    args.event = SCI_EVT_RX_CHAR;
                }
                else
                {
                    /* insufficient free space, store as much as possible */
                    fifo_num = cnt;
                    args.event = SCI_EVT_RXBUF_OVFL;
                }

                /* WAIT_LOOP */
                for( cnt = 0; cnt < fifo_num; cnt++ )
                {
                    /* store bytes to rx queue for R_SCI_Receive */
                    ( void ) R_BYTEQ_Put( hdl->u_rx_data.que, byte_rx[ cnt ] );
                }

                /* Do callback if available */
                if( ( NULL != hdl->callback ) && ( FIT_NO_FUNC != hdl->callback ) )
                {
                    args.hdl = hdl;

                    /* Number of bytes were stored to queue */
                    args.num = ( uint8_t ) fifo_num;

                    /* Casting pointer to void* type is valid */
                    hdl->callback( ( void * ) &args );
                }
            #endif /* End of SCI_CFG_ASYNC_INCLUDED*/
        }
        else
        {
            #if ( SCI_CFG_SSPI_INCLUDED || SCI_CFG_SYNC_INCLUDED )
                /* SCI Receive */
                sci_fifo_receive_sync( hdl );
            #endif
        }

        /* When the readings of receive data are completed, set the SSRFIFO.RDF flag to 0. */
        if( 1 == hdl->rom->regs->SSRFIFO.BIT.RDF )
        {
            /* Casting 8 bits to unsigned char type is valid */
            hdl->rom->regs->SSRFIFO.BYTE = ( unsigned char ) ~SCI_SSRFIFO_RDF_MASK;
        }

        if( SCI_MODE_ASYNC == hdl->mode )
        {
            if( 1 == hdl->rom->regs->SSRFIFO.BIT.DR )
            {
                /* Casting 8 bits to unsigned char type is valid */
                hdl->rom->regs->SSRFIFO.BYTE = ( unsigned char ) ~SCI_SSRFIFO_DR_MASK;
            }
        }
    } /* End of function sci_fifo_receive() */
#endif /* End of SCI_CFG_FIFO_INCLUDED */

#if SCI_CFG_DATA_MATCH_INCLUDED

/*****************************************************************************
 * Function Name: sci_receive_data_match
 * Description  : SCI receive data match
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
    static void sci_receive_data_match( sci_hdl_t const hdl )
    {
        sci_cb_args_t args;
        uint8_t byte;

        if( SCI_MODE_ASYNC == hdl->mode )
        {
            #if ( SCI_CFG_ASYNC_INCLUDED )
                if( 0 == hdl->rom->regs->DCCR.BIT.DCME )                                                   /* DCME automatically set 0 when data matched */
                {
                    hdl->rom->regs->DCCR.BIT.DCMF = 0;                                                     /* Clear Data Match Flag */

                    if( ( 0 == hdl->rom->regs->DCCR.BIT.DFER ) && ( 0 == hdl->rom->regs->DCCR.BIT.DPER ) ) /* Check framing error and parity error */
                    {
                        /* Casting unsigned char type to unin8_t type is valid */
                        byte = ( uint8_t ) ( hdl->rom->regs->CDR.BYTE.L ); /* Read data from comparison data register */

                        /* Place byte in queue */
                        if( R_BYTEQ_Put( hdl->u_rx_data.que, byte ) == BYTEQ_SUCCESS )
                        {
                            args.event = SCI_EVT_RX_CHAR_MATCH;
                        }
                        else
                        {
                            args.event = SCI_EVT_RXBUF_OVFL;
                        }

