FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
                        /* Do callback if available */
                        if( ( NULL != hdl->callback ) && ( FIT_NO_FUNC != hdl->callback ) )
                        {
                            args.hdl = hdl;
                            args.byte = byte;

                            /* Casting to void* type is valid  */
                            hdl->callback( ( void * ) &args );
                        }
                    }
                }
            #endif /* End of SCI_CFG_ASYNC_INCLUDED */
        }
    } /* End of function sci_receive_data_match() */
#endif /* End of SCI_CFG_DATA_MATCH_INCLUDED */

/*****************************************************************************
 * Function Name: rxi_handler
 * Description  : RXI interrupt handler for SCI
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
void rxi_handler( sci_hdl_t const hdl )
{
    #if SCI_CFG_DATA_MATCH_INCLUDED
        if( 1 == hdl->rom->regs->DCCR.BIT.DCMF ) /* Check Data match flag */
        {
            sci_receive_data_match( hdl );
        }
        else
    #endif
    #if SCI_CFG_FIFO_INCLUDED
        if( true == hdl->fifo_ctrl )
        {
            /* SCI FIFO Receive */
            sci_fifo_receive( hdl );
        }
        else
    #endif
    {
        /* SCI Receive */
        sci_receive( hdl );
    }
} /* End of function rxi_handler() */


/*****************************************************************************
 * Function Name: sci_error
 * Description  : Error for SCI
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
static void sci_error( sci_hdl_t const hdl )
{
    sci_cb_args_t args;
    uint8_t byte;
    uint8_t reg;

    reg = SCI_SSR;

    if( 0 != ( reg & SCI_RCVR_ERR_MASK ) )
    {
        if( 0 != ( reg & SCI_SSR_ORER_MASK ) )
        {
            args.event = SCI_EVT_OVFL_ERR;
        }

        #if ( SCI_CFG_ASYNC_INCLUDED )
            else if( 0 != ( reg & SCI_SSR_PER_MASK ) )
            {
                args.event = SCI_EVT_PARITY_ERR;
            }
            else if( 0 != ( reg & SCI_SSR_FER_MASK ) )
            {
                args.event = SCI_EVT_FRAMING_ERR;
            }
        #endif
        else
        {
            /* Do Nothing */
        }

        /* Flush register */
        SCI_RDR( byte );

        /* Clear error condition */
        /* WAIT_LOOP */
        while( 0 != ( SCI_SSR & SCI_RCVR_ERR_MASK ) )
        {
            SCI_RDR( byte );

            reg = SCI_SSR;
            reg &= ( ~SCI_RCVR_ERR_MASK );
            reg |= SCI_SSR_CLR_MASK;
            SCI_SSR = reg;

            if( 0 != ( SCI_SSR & SCI_RCVR_ERR_MASK ) )
            {
                R_BSP_NOP(); /* read and Compare */
            }
        }

        /* Do callback for error */
        if( ( NULL != hdl->callback ) && ( FIT_NO_FUNC != hdl->callback ) )
        {
            args.hdl = hdl;
            args.byte = byte;

            /* Casting to void* type is valid */
            hdl->callback( ( void * ) &args );
        }
    }
} /* End of function sci_error() */

#if SCI_CFG_FIFO_INCLUDED

/*****************************************************************************
 * Function Name: sci_fifo_error
 * Description  : FIFO Error for SCI
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
    static void sci_fifo_error( sci_hdl_t const hdl )
    {
        sci_cb_args_t args;
        uint8_t reg;
        volatile uint8_t ssrfifo_data;
        volatile uint16_t dummy;

        reg = SCI_SSRFIFO;

        if( 0 != ( reg & SCI_RCVR_ERR_MASK ) )
        {
            if( 0 != ( reg & SCI_SSR_ORER_MASK ) )
            {
                args.event = SCI_EVT_OVFL_ERR;
            }

            #if ( SCI_CFG_ASYNC_INCLUDED )
                else if( 0 != ( reg & SCI_SSR_PER_MASK ) )
                {
                    args.event = SCI_EVT_PARITY_ERR;
                }
                else if( 0 != ( reg & SCI_SSR_FER_MASK ) )
                {
                    args.event = SCI_EVT_FRAMING_ERR;
                }
            #endif
            else
            {
                /* Do Nothing */
            }

            /* Do callback for error */
            if( ( NULL != hdl->callback ) && ( FIT_NO_FUNC != hdl->callback ) )
            {
                args.hdl = hdl;
                args.byte = 0;

                /* Casting pointer to void* type is valid */
                hdl->callback( ( void * ) &args );
            }

            /* if error condition don't clear in callback when it clear at here */
            reg = SCI_SSRFIFO;

            if( 0 != ( reg & SCI_RCVR_ERR_MASK ) )
            {
                /* Flush register */
                /* WAIT_LOOP */
                while( 0 != hdl->rom->regs->FDR.BIT.R )
                {
                    dummy = hdl->rom->regs->FRDR.WORD;          /* FRDR dummy read */
                }

                /* Clear error condition */
                /* WAIT_LOOP */
                while( 0x00 != ( SCI_SSRFIFO & SCI_RCVR_ERR_MASK ) ) /* Check PER, FER, ORER flags */
                {
                    ssrfifo_data = SCI_SSRFIFO;                      /* SSRFIFO dummy read */
                    SCI_SSRFIFO = ( uint8_t ) ~SCI_RCVR_ERR_MASK;    /* PER, FER, ORER clear */

                    if( 0x00 != ( SCI_SSRFIFO & SCI_RCVR_ERR_MASK ) )
                    {
                        R_BSP_NOP();                            /* read and Compare */
                    }
                }
            }
        }
    } /* End of function sci_fifo_error() */
#endif /* End of SCI_CFG_FIFO_INCLUDED */

/*****************************************************************************
 * Function Name: eri_handler
 * Description  : ERI interrupt handler for SCI UART mode
 * Arguments    : hdl -
 *                    handle for channel (ptr to chan control block)
 * Return Value : none
 ******************************************************************************/
void eri_handler( sci_hdl_t const hdl )
{
    #if SCI_CFG_FIFO_INCLUDED
        if( true == hdl->fifo_ctrl )
        {
            /* SCI FIFO Error */
            sci_fifo_error( hdl );
        }
        else
    #endif
    {
        /* SCI error */
        sci_error( hdl );
    }
} /* End of function eri_handler() */

