FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_Renesas_e2studio_CS+/src/smc_gen/r_sci_rx/src/r_sci_rx.c
/***********************************************************************************************************************
 * Function Name: R_SCI_Control
 ********************************************************************************************************************//**
 * @brief  This function configures and controls the operating mode for the SCI channel.
 *
 * @param[in] hdl  Handle for channel. Set hdl when R_SCI_Open() is successfully processed.
 *
 * @param[in] cmd  Command to run (see Section 3. R_SCI_Control() in application note for details)
 *
 * @param[in] p_args   Pointer to arguments (see Section 3. R_SCI_Control() in application note for details) specific to
 * command, casted to void *
 *
 * @retval SCI_SUCCESS  Successful; channel initialized.
 *
 * @retval SCI_ERR_NULL_PTR  hdl or p_args pointer is NULL (when required)
 *
 * @retval SCI_ERR_BAD_MODE  Mode specified not currently supported
 *
 * @retval SCI_ERR_INVALID_ARG
 *                    The cmd value or an element of p_args contains an invalid value.
 * @details This function is used for configuring special hardware features such as changing driver configuration and
 * obtaining driver status.
 * The CTS/ RTS pin functions as RTS by default hardware control. By issuing an SCI_CMD_EN_CTS_IN, the pin functions as CTS.
 * @note When SCI_CMD_CHANGE_BAUD is used, the optimum values for BRR, SEMR.ABCS, and SMR.CKS is calculated based on
 * the bit rate specified. This however does not guarantee a low bit error rate for all peripheral clock/baud rate
 * combinations.\n
 * If the command SCI_CMD_EN_CTS_IN is to be used, the pin direction must be selected before calling the
 * R_SCI_Open() function, and the pin function and mode must be selected after calling the R_SCI_Open()
 * function. See Section 3. R_SCI_Control() for details.
 */
sci_err_t R_SCI_Control( sci_hdl_t const hdl,
                         sci_cmd_t const cmd,
                         void * p_args )
{
    sci_err_t err = SCI_SUCCESS;
    sci_baud_t * baud;
    int32_t bit_err;


    #if SCI_CFG_PARAM_CHECKING_ENABLE
        /* Check argument hdl */
        if( ( NULL == hdl ) || ( FIT_NO_PTR == hdl ) )
        {
            return SCI_ERR_NULL_PTR;
        }

        /* Check argument p_args*/
        if( ( NULL == p_args ) || ( FIT_NO_PTR == p_args ) )
        {
            if( SCI_CMD_CHANGE_BAUD == cmd )
            {
                return SCI_ERR_NULL_PTR;
            }

            #if SCI_CFG_FIFO_INCLUDED
                if( ( SCI_CMD_CHANGE_TX_FIFO_THRESH == cmd ) || ( SCI_CMD_CHANGE_RX_FIFO_THRESH == cmd ) )
                {
                    return SCI_ERR_NULL_PTR;
                }
            #endif
            #if defined( BSP_MCU_RX64M ) || defined( BSP_MCU_RX71M ) || defined( BSP_MCU_RX65N ) || defined( BSP_MCU_RX66T ) || defined( BSP_MCU_RX72T ) || defined( BSP_MCU_RX72M ) || defined( BSP_MCU_RX72N ) || defined( BSP_MCU_RX66N )
                if( ( SCI_CMD_SET_TXI_PRIORITY == cmd ) || ( SCI_CMD_SET_RXI_PRIORITY == cmd ) )
                {
                    return SCI_ERR_NULL_PTR;
                }
            #endif
        }

        if( ( SCI_MODE_OFF == hdl->mode ) || ( SCI_MODE_MAX <= hdl->mode ) )
        {
            return SCI_ERR_BAD_MODE;
        }

        #if SCI_CFG_FIFO_INCLUDED
            if( SCI_CMD_CHANGE_TX_FIFO_THRESH == cmd )
            {
                /* Casting void* type is valid */
                if( 15 < ( *( uint8_t * ) p_args ) )
                {
                    return SCI_ERR_INVALID_ARG;
                }
            }

            if( SCI_CMD_CHANGE_RX_FIFO_THRESH == cmd )
            {
                /* Casting void* type is valid */
                if( ( 1 > ( *( uint8_t * ) p_args ) ) || ( 15 < ( *( uint8_t * ) p_args ) ) )
                {
                    return SCI_ERR_INVALID_ARG;
                }
            }
        #endif /* if SCI_CFG_FIFO_INCLUDED */
        #if defined( BSP_MCU_RX64M ) || defined( BSP_MCU_RX71M ) || defined( BSP_MCU_RX65N ) || defined( BSP_MCU_RX66T ) || defined( BSP_MCU_RX72T ) || defined( BSP_MCU_RX72M ) || defined( BSP_MCU_RX72N ) || defined( BSP_MCU_RX66N )
            if( ( SCI_CMD_SET_TXI_PRIORITY == cmd ) || ( SCI_CMD_SET_RXI_PRIORITY == cmd ) )
            {
                /* Casting void* type is valid */
                if( ( 1 > ( *( uint8_t * ) p_args ) ) || ( BSP_MCU_IPL_MAX < ( *( uint8_t * ) p_args ) ) )
                {
                    return SCI_ERR_INVALID_ARG;
                }
            }
        #endif
    #endif /* End of SCI_CFG_PARAM_CHECKING_ENABLE */

    /* COMMANDS COMMON TO ALL MODES */

    switch( cmd )
    {
        case ( SCI_CMD_CHANGE_BAUD ):
            /* Casting void* type is valid */
            baud = ( sci_baud_t * ) p_args;
            #if ( SCI_CFG_ASYNC_INCLUDED )
            hdl->pclk_speed = baud->pclk;       /* save for break generation */
            #endif
            hdl->rom->regs->SCR.BYTE &= ( ~SCI_EN_XCVR_MASK );
            SCI_SCR_DUMMY_READ;
            bit_err = sci_init_bit_rate( hdl, baud->pclk, baud->rate );
            SCI_IR_TXI_CLEAR;
            hdl->rom->regs->SCR.BYTE |= SCI_EN_XCVR_MASK;

            if( 1000 == bit_err )
            {
                err = SCI_ERR_INVALID_ARG;  /* impossible baud rate; 100% error */
            }
            else
            {
                hdl->baud_rate = baud->rate; /* save for break generation */
            }

            break;

        case ( SCI_CMD_EN_CTS_IN ):

            if( SCI_MODE_SSPI != hdl->mode )
            {
                /* PFS & port pins must be configured for CTS prior to calling this */
                hdl->rom->regs->SCR.BYTE &= ( ~SCI_EN_XCVR_MASK );
                SCI_SCR_DUMMY_READ;
                hdl->rom->regs->SPMR.BIT.CTSE = 1;  /* enable CTS input */
                SCI_IR_TXI_CLEAR;
                hdl->rom->regs->SCR.BYTE |= SCI_EN_XCVR_MASK;
            }
            else
            {
                /* Can not use CTS in smart card interface mode, simple SPI mode, and simple I2C mode */
                err = SCI_ERR_INVALID_ARG;
            }

            break;

            #if SCI_CFG_FIFO_INCLUDED
                case ( SCI_CMD_CHANGE_TX_FIFO_THRESH ):

                    if( true == hdl->fifo_ctrl )
                    {
                        /* save current TX FIFO threshold */
                        hdl->tx_curr_thresh = *( ( uint8_t * ) p_args );

